logs/stunnelfs/fio-randread.log
job-randr: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process
3;fio-3.16;job-randr;0;0;2097152;101502;25375;20661;1;3759;20.124074;34.005563;55;20559;1237.107365;564.459090;1.000000%=552;5.000000%=741;10.000000%=831;20.000000%=937;30.000000%=1028;40.000000%=1105;50.000000%=1171;60.000000%=1253;70.000000%=1335;80.000000%=1433;90.000000%=1613;95.000000%=1794;99.000000%=3555;99.500000%=4423;99.900000%=6127;99.950000%=6979;99.990000%=19267;0%=0;0%=0;0%=0;202;20562;1257.836577;563.184167;91560;115416;99.905445%;101406.024390;5384.989947;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;4.574056%;14.835431%;535431;0;42;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.58%;4.68%;21.62%;70.32%;1.97%;0.79%;0.03%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%

job-randr: (groupid=0, jobs=1): err= 0: pid=74179: Fri Oct  1 10:44:27 2021
  read: IOPS=25.4k, BW=99.1MiB/s (104MB/s)(2048MiB/20661msec)
    slat (nsec): min=1060, max=3759.0k, avg=20124.07, stdev=34005.56
    clat (usec): min=55, max=20559, avg=1237.11, stdev=564.46
     lat (usec): min=202, max=20562, avg=1257.84, stdev=563.18
    clat percentiles (usec):
     |  1.00th=[  553],  5.00th=[  742], 10.00th=[  832], 20.00th=[  938],
     | 30.00th=[ 1029], 40.00th=[ 1106], 50.00th=[ 1172], 60.00th=[ 1254],
     | 70.00th=[ 1336], 80.00th=[ 1434], 90.00th=[ 1614], 95.00th=[ 1795],
     | 99.00th=[ 3556], 99.50th=[ 4424], 99.90th=[ 6128], 99.95th=[ 6980],
     | 99.99th=[19268]
   bw (  KiB/s): min=91560, max=115416, per=99.91%, avg=101406.02, stdev=5384.99, samples=41
   iops        : min=22890, max=28854, avg=25351.49, stdev=1346.24, samples=41
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.58%, 750=4.68%, 1000=21.62%
  lat (msec)   : 2=70.32%, 4=1.97%, 10=0.79%, 20=0.03%, 50=0.01%
  cpu          : usr=4.57%, sys=14.84%, ctx=535431, majf=0, minf=42
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=524288,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=99.1MiB/s (104MB/s), 99.1MiB/s-99.1MiB/s (104MB/s-104MB/s), io=2048MiB (2147MB), run=20661-20661msec