logs/stunnelfs/fio-randwrite.log
job-randw: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process
3;fio-3.16;job-randw;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2097152;71171;17792;29466;1;2579;6.159790;12.771717;358;23123;1790.613841;674.523073;1.000000%=1253;5.000000%=1351;10.000000%=1400;20.000000%=1482;30.000000%=1531;40.000000%=1597;50.000000%=1662;60.000000%=1728;70.000000%=1826;80.000000%=1941;90.000000%=2211;95.000000%=2539;99.000000%=4489;99.500000%=5472;99.900000%=7438;99.950000%=13303;99.990000%=21626;0%=0;0%=0;0%=0;374;23126;1796.997272;674.322527;64256;77968;99.847478%;71062.448276;2608.332641;3.315798%;8.433735%;576194;0;9;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.02%;0.05%;82.82%;15.80%;1.25%;0.04%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%

job-randw: (groupid=0, jobs=1): err= 0: pid=74172: Fri Oct  1 10:44:01 2021
  write: IOPS=17.8k, BW=69.5MiB/s (72.9MB/s)(2048MiB/29466msec); 0 zone resets
    slat (nsec): min=1160, max=2579.7k, avg=6159.79, stdev=12771.72
    clat (usec): min=358, max=23123, avg=1790.61, stdev=674.52
     lat (usec): min=374, max=23126, avg=1797.00, stdev=674.32
    clat percentiles (usec):
     |  1.00th=[ 1254],  5.00th=[ 1352], 10.00th=[ 1401], 20.00th=[ 1483],
     | 30.00th=[ 1532], 40.00th=[ 1598], 50.00th=[ 1663], 60.00th=[ 1729],
     | 70.00th=[ 1827], 80.00th=[ 1942], 90.00th=[ 2212], 95.00th=[ 2540],
     | 99.00th=[ 4490], 99.50th=[ 5473], 99.90th=[ 7439], 99.95th=[13304],
     | 99.99th=[21627]
   bw (  KiB/s): min=64256, max=77968, per=99.85%, avg=71062.45, stdev=2608.33, samples=58
   iops        : min=16064, max=19492, avg=17765.60, stdev=652.08, samples=58
  lat (usec)   : 500=0.01%, 750=0.02%, 1000=0.05%
  lat (msec)   : 2=82.82%, 4=15.80%, 10=1.25%, 20=0.04%, 50=0.02%
  cpu          : usr=3.32%, sys=8.43%, ctx=576194, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,524288,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=69.5MiB/s (72.9MB/s), 69.5MiB/s-69.5MiB/s (72.9MB/s-72.9MB/s), io=2048MiB (2147MB), run=29466-29466msec