logs/stunnelfs/fio-read.log
job-r: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=4
fio-3.16
Starting 1 process
3;fio-3.16;job-r;0;0;2097152;128801;1006;16282;4;2086;26.152413;36.536078;144;214616;3944.373180;10199.561691;1.000000%=481;5.000000%=602;10.000000%=733;20.000000%=1019;30.000000%=1417;40.000000%=2899;50.000000%=4079;60.000000%=4145;70.000000%=4227;80.000000%=4292;90.000000%=4423;95.000000%=5734;99.000000%=18481;99.500000%=19267;99.900000%=210763;99.950000%=212860;99.990000%=214958;0%=0;0%=0;0%=0;369;214625;3970.934905;10200.069584;79104;375296;100.000000%;129024.375000;46022.416399;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.393096%;1.652233%;30902;0;138;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.02%;1.50%;9.05%;8.84%;17.30%;10.15%;49.13%;3.64%;0.15%;0.00%;0.22%;0.00%;0.00%;0.00%;0.00%;0.00%

job-r: (groupid=0, jobs=1): err= 0: pid=74078: Fri Oct  1 10:43:26 2021
  read: IOPS=1006, BW=126MiB/s (132MB/s)(2048MiB/16282msec)
    slat (usec): min=4, max=2086, avg=26.15, stdev=36.54
    clat (usec): min=144, max=214616, avg=3944.37, stdev=10199.56
     lat (usec): min=369, max=214625, avg=3970.93, stdev=10200.07
    clat percentiles (usec):
     |  1.00th=[   482],  5.00th=[   603], 10.00th=[   734], 20.00th=[  1020],
     | 30.00th=[  1418], 40.00th=[  2900], 50.00th=[  4080], 60.00th=[  4146],
     | 70.00th=[  4228], 80.00th=[  4293], 90.00th=[  4424], 95.00th=[  5735],
     | 99.00th=[ 18482], 99.50th=[ 19268], 99.90th=[210764], 99.95th=[212861],
     | 99.99th=[214959]
   bw (  KiB/s): min=79104, max=375296, per=100.00%, avg=129024.38, stdev=46022.42, samples=32
   iops        : min=  618, max= 2932, avg=1008.00, stdev=359.55, samples=32
  lat (usec)   : 250=0.02%, 500=1.50%, 750=9.05%, 1000=8.84%
  lat (msec)   : 2=17.30%, 4=10.15%, 10=49.13%, 20=3.64%, 50=0.15%
  lat (msec)   : 250=0.22%
  cpu          : usr=0.39%, sys=1.65%, ctx=30902, majf=0, minf=138
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16384,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=126MiB/s (132MB/s), 126MiB/s-126MiB/s (132MB/s-132MB/s), io=2048MiB (2147MB), run=16282-16282msec