logs/stunnelfs/fio-write.log
job-w: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=4
fio-3.16
Starting 1 process
job-w: Laying out IO file (1 file / 2048MiB)
3;fio-3.16;job-w;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2097152;128809;1006;16281;6;235;18.170741;12.633413;608;210300;3953.616179;5497.526524;1.000000%=897;5.000000%=1105;10.000000%=1236;20.000000%=1646;30.000000%=2408;40.000000%=3653;50.000000%=4046;60.000000%=4177;70.000000%=4292;80.000000%=4358;90.000000%=4816;95.000000%=6389;99.000000%=18481;99.500000%=19267;99.900000%=35389;99.950000%=55312;99.990000%=210763;0%=0;0%=0;0%=0;617;210313;3972.075469;5498.403539;118016;343808;100.000000%;128944.531250;39654.811331;0.718673%;1.818182%;15100;0;12;0.1%;0.1%;100.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.19%;2.34%;22.86%;21.64%;49.60%;3.04%;0.26%;0.02%;0.05%;0.00%;0.00%;0.00%;0.00%;0.00%

job-w: (groupid=0, jobs=1): err= 0: pid=74071: Fri Oct  1 10:43:04 2021
  write: IOPS=1006, BW=126MiB/s (132MB/s)(2048MiB/16281msec); 0 zone resets
    slat (usec): min=6, max=235, avg=18.17, stdev=12.63
    clat (usec): min=608, max=210300, avg=3953.62, stdev=5497.53
     lat (usec): min=617, max=210313, avg=3972.08, stdev=5498.40
    clat percentiles (usec):
     |  1.00th=[   898],  5.00th=[  1106], 10.00th=[  1237], 20.00th=[  1647],
     | 30.00th=[  2409], 40.00th=[  3654], 50.00th=[  4047], 60.00th=[  4178],
     | 70.00th=[  4293], 80.00th=[  4359], 90.00th=[  4817], 95.00th=[  6390],
     | 99.00th=[ 18482], 99.50th=[ 19268], 99.90th=[ 35390], 99.95th=[ 55313],
     | 99.99th=[210764]
   bw (  KiB/s): min=118016, max=343808, per=100.00%, avg=128944.53, stdev=39654.81, samples=32
   iops        : min=  922, max= 2686, avg=1007.38, stdev=309.80, samples=32
  lat (usec)   : 750=0.19%, 1000=2.34%
  lat (msec)   : 2=22.86%, 4=21.64%, 10=49.60%, 20=3.04%, 50=0.26%
  lat (msec)   : 100=0.02%, 250=0.05%
  cpu          : usr=0.72%, sys=1.82%, ctx=15100, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16384,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=126MiB/s (132MB/s), 126MiB/s-126MiB/s (132MB/s-132MB/s), io=2048MiB (2147MB), run=16281-16281msec